In [57]:
import pandas as pd

###### Creating Series with default Index

In [58]:
grades = pd.Series([95,98,91,93,100])

In [59]:
grades

0     95
1     98
2     91
3     93
4    100
dtype: int64

In [60]:
pd.Series(98.5,range(4)) #creating series with all same elements

0    98.5
1    98.5
2    98.5
3    98.5
dtype: float64

In [61]:
grades[0]

95

In [62]:
grades.count()

5

In [63]:
grades.min()

91

In [64]:
grades.max()

100

In [65]:
grades.mean()

95.4

In [66]:
grades.std()

3.6469165057620936

In [67]:
grades.describe()

count      5.00
mean      95.40
std        3.65
min       91.00
25%       93.00
50%       95.00
75%       98.00
max      100.00
dtype: float64

In [68]:
marks = pd.Series([87,100,94],index=['A','B','C'])  #series with custom indexes
marks

A     87
B    100
C     94
dtype: int64

In [69]:
scores = pd.Series({'Raju':89,'King':99,'Roger':98})
scores

Raju     89
King     99
Roger    98
dtype: int64

In [70]:
scores['King']

99

In [71]:
scores.Roger

98

In [72]:
scores.values

array([89, 99, 98], dtype=int64)

###### Creating Series of  Strings

In [73]:
names = pd.Series(['Bengaluru','Mumbai','Chennai'])
names

0    Bengaluru
1       Mumbai
2      Chennai
dtype: object

In [74]:
names.str.contains('C')

0    False
1    False
2     True
dtype: bool

In [75]:
names.str.upper()

0    BENGALURU
1       MUMBAI
2      CHENNAI
dtype: object

###### DataFrames

In [76]:
grades_dict = {'Ram':[87,96,95],'Bhim':[87,85,84],'Krish':[100,100,99],'Ravi':[88,89,86],'Sanju':[89,81,93]}
grades_df = pd.DataFrame(grades_dict)
grades_df

   Ram  Bhim  Krish  Ravi  Sanju
0   87    87    100    88     89
1   96    85    100    89     81
2   95    84     99    86     93

In [77]:
grades_df.index=['Phy','Maths','Chem']
grades_df

       Ram  Bhim  Krish  Ravi  Sanju
Phy     87    87    100    88     89
Maths   96    85    100    89     81
Chem    95    84     99    86     93

In [78]:
grades_df['Ram']

Phy      87
Maths    96
Chem     95
Name: Ram, dtype: int64

In [79]:
grades_df.Krish

Phy      100
Maths    100
Chem      99
Name: Krish, dtype: int64

In [80]:
grades_df.loc['Phy']

Ram       87
Bhim      87
Krish    100
Ravi      88
Sanju     89
Name: Phy, dtype: int64

In [81]:
grades_df.iloc[1]

Ram       96
Bhim      85
Krish    100
Ravi      89
Sanju     81
Name: Maths, dtype: int64

In [82]:
grades_df.loc['Maths':'Chem']

       Ram  Bhim  Krish  Ravi  Sanju
Maths   96    85    100    89     81
Chem    95    84     99    86     93

In [83]:
grades_df.iloc[0:2]

       Ram  Bhim  Krish  Ravi  Sanju
Phy     87    87    100    88     89
Maths   96    85    100    89     81

In [84]:
grades_df.loc[['Phy','Chem']]

      Ram  Bhim  Krish  Ravi  Sanju
Phy    87    87    100    88     89
Chem   95    84     99    86     93

In [85]:
grades_df.loc['Phy':'Chem',['Ram','Krish']]

       Ram  Krish
Phy     87    100
Maths   96    100
Chem    95     99

In [86]:
grades_df.iloc[[0,2],0:3]

      Ram  Bhim  Krish
Phy    87    87    100
Chem   95    84     99

##### Boolean Indexing

In [87]:
grades_df[grades_df >= 80]

       Ram  Bhim  Krish  Ravi  Sanju
Phy     87    87    100    88     89
Maths   96    85    100    89     81
Chem    95    84     99    86     93

In [88]:
grades_df[(grades_df >=80) & (grades_df <= 90)]

        Ram  Bhim  Krish  Ravi  Sanju
Phy    87.0    87    NaN    88   89.0
Maths   NaN    85    NaN    89   81.0
Chem    NaN    84    NaN    86    NaN

In [89]:
grades_df.at['Phy','Krish']

100

In [90]:
grades_df.iat[1,2]

100

In [91]:
grades_df.at['Chem','Krish']=100
grades_df.at['Chem','Krish']

100

In [92]:
grades_df.iat[0,1]=100
grades_df.iat[0,1]

100

In [93]:
grades_df.describe()

         Ram    Bhim  Krish   Ravi  Sanju
count   3.00    3.00    3.0   3.00   3.00
mean   92.67   89.67  100.0  87.67  87.67
std     4.93    8.96    0.0   1.53   6.11
min    87.00   84.00  100.0  86.00  81.00
25%    91.00   84.50  100.0  87.00  85.00
50%    95.00   85.00  100.0  88.00  89.00
75%    95.50   92.50  100.0  88.50  91.00
max    96.00  100.00  100.0  89.00  93.00

In [94]:
pd.set_option('display.precision',2)

In [95]:
grades_df.describe()

         Ram    Bhim  Krish   Ravi  Sanju
count   3.00    3.00    3.0   3.00   3.00
mean   92.67   89.67  100.0  87.67  87.67
std     4.93    8.96    0.0   1.53   6.11
min    87.00   84.00  100.0  86.00  81.00
25%    91.00   84.50  100.0  87.00  85.00
50%    95.00   85.00  100.0  88.00  89.00
75%    95.50   92.50  100.0  88.50  91.00
max    96.00  100.00  100.0  89.00  93.00

In [96]:
grades_df.mean()

Ram       92.67
Bhim      89.67
Krish    100.00
Ravi      87.67
Sanju     87.67
dtype: float64

In [97]:
grades_df.T

       Phy  Maths  Chem
Ram     87     96    95
Bhim   100     85    84
Krish  100    100   100
Ravi    88     89    86
Sanju   89     81    93

In [98]:
grades_df.T.mean()

Phy      92.8
Maths    90.2
Chem     91.6
dtype: float64

In [99]:
grades_df.T.describe()

          Phy   Maths    Chem
count    5.00    5.00    5.00
mean    92.80   90.20   91.60
std      6.61    7.79    6.58
min     87.00   81.00   84.00
25%     88.00   85.00   86.00
50%     89.00   89.00   93.00
75%    100.00   96.00   95.00
max    100.00  100.00  100.00

In [100]:
grades_df.sort_index(ascending=False)

       Ram  Bhim  Krish  Ravi  Sanju
Phy     87   100    100    88     89
Maths   96    85    100    89     81
Chem    95    84    100    86     93

In [101]:
grades_df.sort_index(axis=0)

       Ram  Bhim  Krish  Ravi  Sanju
Chem    95    84    100    86     93
Maths   96    85    100    89     81
Phy     87   100    100    88     89

In [102]:
grades_df.sort_values(by='Phy',axis=1,ascending=False)

       Bhim  Krish  Sanju  Ravi  Ram
Phy     100    100     89    88   87
Maths    85    100     81    89   96
Chem     84    100     93    86   95

In [103]:
grades_df.T.sort_values(by='Maths',ascending=False)

       Phy  Maths  Chem
Krish  100    100   100
Ram     87     96    95
Ravi    88     89    86
Bhim   100     85    84
Sanju   89     81    93

In [106]:
grades_df.loc['Chem'].sort_values(ascending=True)

Bhim      84
Ravi      86
Sanju     93
Ram       95
Krish    100
Name: Chem, dtype: int64